import React, { useState, useRef } from 'react';

export const legislatorItems = [
  {
    title: '臺北市', name: '臺北市',
    legislators: [
      { title: '吳思瑤：第一選舉區（北投、士林）', name: '吳思瑤' },
      { title: '王世堅：第二選舉區（大同、士林）', name: '王世堅' },
      { title: '王鴻薇：第三選舉區（中山、松山）', name: '王鴻薇' },
      { title: '李彥秀：第四選舉區（內湖、南港）', name: '李彥秀' },
      { title: '吳沛憶：第五選舉區（萬華、中正）', name: '吳沛憶' },
      { title: '羅智強：第六選舉區（大安）', name: '羅智強' },
      { title: '徐巧芯：第七選舉區（信義、松山）', name: '徐巧芯' },
      { title: '賴士葆：第八選舉區（文山、中正）', name: '賴士葆' }
    ]
  },
  {
    title: '新北市', name: '新北市',
    legislators: [
      { title: '洪孟楷：第一選舉區（石門、三芝、淡水、八里、林口、泰山）', name: '洪孟楷' },
      { title: '林淑芬：第二選舉區（五股、蘆洲、三重）', name: '林淑芬' },
      { title: '李坤城：第三選舉區（三重）', name: '李坤城' },
      { title: '吳秉叡：第四選舉區（新莊）', name: '吳秉叡' },
      { title: '蘇巧慧：第五選舉區（樹林、鶯歌、新莊）', name: '蘇巧慧' },
      { title: '張宏陸：第六選舉區（板橋）', name: '張宏陸' },
      { title: '葉元之：第七選舉區（板橋）', name: '葉元之' },
      { title: '張智倫：第八選舉區（中和）', name: '張智倫' },
      { title: '林德福：第九選舉區（永和、中和）', name: '林德福' },
      { title: '吳琪銘：第十選舉區（土城、三峽）', name: '吳琪銘' },
      { title: '羅明才：第十一選舉區（新店、深坑、石碇、坪林、烏來）', name: '羅明才' },
      { title: '廖先翔：第十二選舉區（金山、萬里、汐止、平溪、瑞芳、雙溪、貢寮）', name: '廖先翔' }
    ]
  },
  {
    title: '桃園市', name: '桃園市',
    legislators: [
      { title: '牛煦庭：第一選舉區（蘆竹、龜山、桃園）', name: '牛煦庭' },
      { title: '涂權吉：第二選舉區（大園、觀音、新屋、楊梅）', name: '涂權吉' },
      { title: '魯明哲：第三選舉區（中壢）', name: '魯明哲' },
      { title: '萬美玲：第四選舉區（桃園）', name: '萬美玲' },
      { title: '呂玉玲：第五選舉區（平鎮、龍潭）', name: '呂玉玲' },
      { title: '邱若華：第六選舉區（八德、大溪、復興、中壢）', name: '邱若華' }
    ]
  },
  {
    title: '臺中市', name: '臺中市',
    legislators: [
      { title: '蔡其昌：第一選舉區（大甲、大安、外埔、清水、梧棲）', name: '蔡其昌' },
      { title: '顏寬恒：第二選舉區（沙鹿、龍井、大肚、烏日、霧峰）', name: '顏寬恒' },
      { title: '楊瓊瓔：第三選舉區（后里、神岡、大雅、潭子）', name: '楊瓊瓔' },
      { title: '廖偉翔：第四選舉區（西屯、南屯）', name: '廖偉翔' },
      { title: '黃健豪：第五選舉區（北屯、北區）', name: '黃健豪' },
      { title: '羅廷瑋：第六選舉區（西區、中區、東區、南區）', name: '羅廷瑋' },
      { title: '何欣純：第七選舉區（太平、大里）', name: '何欣純' },
      { title: '江啟臣：第八選舉區（豐原、石岡、新社、東勢、和平）', name: '江啟臣' }
    ]
  },
  {
    title: '臺南市', name: '臺南市',
    legislators: [
      { title: '賴惠員：第一選舉區（後壁、白河、北門、學甲、鹽水、新營、柳營、東山、將軍、下營、六甲）', name: '賴惠員' },
      { title: '郭國文：第二選舉區（七股、佳里、麻豆、官田、善化、大內、玉井、楠西、西港、安定、山上、左鎮、南化）', name: '郭國文' },
      { title: '陳亭妃：第三選舉區（安南、北區）', name: '陳亭妃' },
      { title: '林宜瑾：第四選舉區（新市、永康、新化）', name: '林宜瑾' },
      { title: '林俊憲：第五選舉區（安平、中西區、南區、東區）', name: '林俊憲' },
      { title: '王定宇：第六選舉區（仁德、歸仁、關廟、龍崎、東區）', name: '王定宇' }
    ]
  },
  {
    title: '高雄市', name: '高雄市',
    legislators: [
      { title: '邱議瑩：第一選舉區（桃源、那瑪夏、甲仙、六龜、杉林、內門、旗山、美濃、茂林、阿蓮、田寮、燕巢、大社、大樹）', name: '邱議瑩' },
      { title: '邱志偉：第二選舉區（茄萣、湖內、路竹、永安、岡山、彌陀、梓官、橋頭）', name: '邱志偉' },
      { title: '李柏毅：第三選舉區（楠梓、左營）', name: '李柏毅' },
      { title: '林岱樺：第四選舉區（仁武、鳥松、大寮、林園）', name: '林岱樺' },
      { title: '李昆澤：第五選舉區（三民、苓雅）', name: '李昆澤' },
      { title: '黃捷：第六選舉區（鼓山、鹽埕、新興、苓雅）', name: '黃捷' },
      { title: '許智傑：第七選舉區（鳳山）', name: '許智傑' },
      { title: '賴瑞隆：第八選舉區（前鎮、小港、旗津）', name: '賴瑞隆' }
    ]
  },
  {
    title: '基隆市', name: '基隆市',
    legislators: [
      { title: '林沛祥', name: '林沛祥' }
    ]
  },
  {
    title: '新竹縣', name: '新竹縣',
    legislators: [
      { title: '徐欣瑩：第一選舉區（新豐鄉、湖口鄉、新埔鎮、芎林鄉、關西鎮、尖石鄉、竹北市）', name: '徐欣瑩' },
      { title: '林思銘：第二選舉區（竹東鎮、寶山鄉、北埔鄉、峨眉鄉、橫山鄉、五峰鄉、竹北市）', name: '林思銘' }
    ]
  },
  {
    title: '新竹市', name: '新竹市',
    legislators: [
      { title: '鄭正鈐', name: '鄭正鈐' }
    ]
  },
  {
    title: '苗栗縣', name: '苗栗縣',
    legislators: [
      { title: '陳超明：第一選舉區（竹南鎮、造橋鄉、後龍鎮、西湖鄉、通霄鎮、銅鑼鄉、苑裡鎮、三義鄉）', name: '陳超明' },
      { title: '邱鎮軍：第二選舉區（頭份市、三灣鄉、南庄鄉、苗栗市、頭屋鄉、獅潭鄉、公館鄉、大湖鄉、泰安鄉、卓蘭鎮）', name: '邱鎮軍' }
    ]
  },
  {
    title: '彰化縣', name: '彰化縣',
    legislators: [
      { title: '陳秀寳：第一選舉區（伸港鄉、線西鄉、和美鎮、鹿港鎮、福興鄉、秀水鄉）', name: '陳秀寳' },
      { title: '黃秀芳：第二選舉區（彰化市、花壇鄉、芬園鄉）', name: '黃秀芳' },
      { title: '謝衣鳯：第三選舉區（芳苑鄉、二林鎮、埔鹽鄉、溪湖鎮、埔心鄉、大城鄉、竹塘鄉、埤頭鄉、北斗鎮、溪州鄉）', name: '謝衣鳯' },
      { title: '陳素月：第四選舉區（大村鄉、員林市、永靖鄉、社頭鄉、田尾鄉、田中鎮、二水鄉）', name: '陳素月' }
    ]
  },
  {
    title: '南投縣', name: '南投縣',
    legislators: [
      { title: '馬文君：第一選舉區（草屯鎮、國姓鄉、埔里鎮、仁愛鄉、中寮鄉、魚池鄉）', name: '馬文君' },
      { title: '游顥：第二選舉區（南投市、名間鄉、集集鎮、竹山鎮、鹿谷鄉、水里鄉、信義鄉）', name: '游顥' }
    ]
  },
  {
    title: '雲林縣', name: '雲林縣',
    legislators: [
      { title: '丁學忠：第一選舉區（麥寮鄉、臺西鄉、東勢鄉、褒忠鄉、土庫鎮、虎尾鎮、四湖鄉、元長鄉、口湖鄉、水林鄉、北港鎮）', name: '丁學忠' },
      { title: '劉建國：第二選舉區（崙背鄉、二崙鄉、西螺鎮、莿桐鄉、林內鄉、斗六市、大埤鄉、斗南鎮、古坑鄉）', name: '劉建國' }
    ]
  },
  {
    title: '嘉義縣', name: '嘉義縣',
    legislators: [
      { title: '蔡易餘：第一選舉區（六腳鄉、東石鄉、朴子市、太保市、布袋鎮、義竹鄉、鹿草鄉、水上鄉）', name: '蔡易餘' },
      { title: '陳冠廷：第二選舉區（溪口鄉、大林鎮、梅山鄉、新港鄉、民雄鄉、竹崎鄉、中埔鄉、番路鄉、阿里山鄉、大埔鄉）', name: '陳冠廷' }
    ]
  },
  {
    title: '嘉義市', name: '嘉義市',
    legislators: [
      { title: '王美惠', name: '王美惠' }
    ]
  },
  {
    title: '屏東縣', name: '屏東縣',
    legislators: [
      { title: '鍾佳濱：第一選舉區（里港鄉、高樹鄉、三地門鄉、霧臺鄉、瑪家鄉、九如鄉、鹽埔鄉、長治鄉、屏東市、麟洛鄉、內埔鄉）', name: '鍾佳濱' },
      { title: '徐富癸：第二選舉區（萬丹鄉、泰武鄉﹑竹田鄉、萬巒鄉、潮州鎮、新園鄉、崁頂鄉、南州鄉、新埤鄉、來義鄉、東港鎮、林邊鄉、佳冬鄉、枋寮鄉、春日鄉、枋山鄉、獅子鄉、牡丹鄉、車城鄉、滿州鄉、恆春鎮、琉球鄉）', name: '徐富癸' }
    ]
  },
  {
    title: '宜蘭縣', name: '宜蘭縣',
    legislators: [
      { title: '陳俊宇', name: '陳俊宇' }
    ]
  },
  {
    title: '花蓮縣', name: '花蓮縣',
    legislators: [
      { title: '傅崐萁', name: '傅崐萁' }
    ]
  },
  {
    title: '臺東縣', name: '臺東縣',
    legislators: [
      { title: '黃建賓', name: '黃建賓' }
    ]
  },
  {
    title: '澎湖縣', name: '澎湖縣',
    legislators: [
      { title: '楊曜', name: '楊曜' }
    ]
  },
  {
    title: '金門縣', name: '金門縣',
    legislators: [
      { title: '陳玉珍', name: '陳玉珍' }
    ]
  },
  {
    title: '連江縣', name: '連江縣',
    legislators: [
      { title: '陳雪生', name: '陳雪生' }
    ]
  },
  {
    title: '平地原住民', name: '平地原住民',
    legislators: [
      { title: '鄭天財Sra Kacaw', name: '鄭天財Sra Kacaw' },
      { title: '陳瑩', name: '陳瑩' },
      { title: '黃仁', name: '黃仁' }
    ]
  },
  {
    title: '山地原住民', name: '山地原住民',
    legislators: [
      { title: '高金素梅', name: '高金素梅' },
      { title: '伍麗華Saidhai Tahovecahe', name: '伍麗華Saidhai Tahovecahe' },
      { title: '盧縣一', name: '盧縣一' }
    ]
  },
  {
    title: '民主進步黨（不分區）', name: '民主進步黨（不分區）',
    legislators: [
      { title: '林月琴', name: '林月琴' },
      { title: '沈伯洋', name: '沈伯洋' },
      { title: '張雅琳', name: '張雅琳' },
      { title: '洪申翰', name: '洪申翰' },
      { title: '羅美玲', name: '羅美玲' },
      { title: '范雲', name: '范雲' },
      { title: '柯建銘', name: '柯建銘' },
      { title: '沈發惠', name: '沈發惠' },
      { title: '莊瑞雄', name: '莊瑞雄' },
      { title: '林楚茵', name: '林楚茵' },
      { title: '郭昱晴', name: '郭昱晴' },
      { title: '王正旭', name: '王正旭' },
      { title: '王義川', name: '王義川' },
      { title: '陳培瑜', name: '陳培瑜' },
    ]
  },
  {
    title: '中國國民黨（不分區）', name: '中國國民黨（不分區）',
    legislators: [
      { title: '韓國瑜', name: '韓國瑜' },
      { title: '柯志恩', name: '柯志恩' },
      { title: '葛如鈞', name: '葛如鈞' },
      { title: '翁曉玲', name: '翁曉玲' },
      { title: '陳菁徽', name: '陳菁徽' },
      { title: '吳宗憲', name: '吳宗憲' },
      { title: '林倩綺', name: '林倩綺' },
      { title: '陳永康', name: '陳永康' },
      { title: '許宇甄', name: '許宇甄' },
      { title: '謝龍介', name: '謝龍介' },
      { title: '蘇清泉', name: '蘇清泉' },
      { title: '張嘉郡', name: '張嘉郡' },
      { title: '王育敏', name: '王育敏' }
    ]
  },
  {
    title: '台灣民眾黨（不分區）', name: '台灣民眾黨（不分區）',
    legislators: [
      { title: '黃珊珊', name: '黃珊珊' },
      { title: '黃國昌', name: '黃國昌' },
      { title: '陳昭姿', name: '陳昭姿' },
      { title: '麥玉珍', name: '麥玉珍' },
      { title: '林國成', name: '林國成' },
      { title: '林憶君', name: '林憶君' },
      { title: '張啓楷', name: '張啓楷' },
      { title: '劉書彬', name: '劉書彬' },
    ]
  },
];
